snlkuharlocal/src/DataProcessors/СравнениеЛистовНабораПоСтрокам/СравнениеЛистовНабораПоСтрокам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СравнениеЛистовНабораПоСтрокам</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСравнения</name>
  </attributes>
  <attributes>
    <name>фТолькоОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключаемыйЛН</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>фВыводитьЛН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланНабора</name>
    <type>
      <types>DocumentRef.ПланНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокСтрок</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ТипСклада/ТипСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипСклада</name>
  <enumValues>
    <name>ОптовыйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>РозничныйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Офис</name>
  </enumValues>
  <enumValues>
    <name>КБСтиль</name>
  </enumValues>
  <enumValues>
    <name>SNL</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСклад</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСкладРезерв</name>
  </enumValues>
  <enumValues>
    <name>ПалетноеХранение</name>
  </enumValues>
  <enumValues>
    <name>СкладВозвратов</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйСклад</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
  <enumValues>
    <name>Перепаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ВидыДопОбработки/ВидыДопОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДопОбработки</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезОбработки</name>
      <description>Без обработки</description>
    </items>
    <items>
      <name>ЕвроКрючок</name>
      <description>Евро-крючок</description>
    </items>
    <items>
      <name>ЗаказыFBS_КонтрольКодовМаркировки</name>
      <description>Заказы FBS. Контроль кодов маркировки</description>
    </items>
    <items>
      <name>Комплектация</name>
      <description>Комплектация</description>
    </items>
    <items>
      <name>ОтгрузкаУпаковкиОтдельно</name>
      <description>Отгрузка упаковки</description>
    </items>
    <items>
      <name>ПаллетаКроссДокинг</name>
      <description>Паллета КроссДокинг</description>
    </items>
    <items>
      <name>Паллетирование</name>
      <description>Паллетирование</description>
    </items>
    <items>
      <name>УпаковкаВКосметичку</name>
      <description>Упаковка в косметичку</description>
    </items>
    <items>
      <name>УпаковкаТовара</name>
      <description>Упаковка товара</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПаллетирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Неиспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьУпаковку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/СравнениеЛистовНабораПоСтрокам/ObjectModule.bsl
Процедура Заполнить() Экспорт
	ВидДокумента=Документ.Метаданные().Имя;
	
	ИмяРеквизитаКоличество	="Количество";
	ИмяРеквизитаСостояние	="СостояниеНакладной";
	
	Если ВидДокумента="Перемещение" Тогда		
		Если Документ.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда			
			ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка"; //Отгружено
		ИначеЕсли Документ.СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
			ИмяРеквизитаСостояние	="СостояниеНакладнойУПолучателя";			
		КонецЕсли;		
	КонецЕсли;
	
	//Нечаева +++
	Если ВидДокумента="ПродажаИМ" Тогда
		ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка";
	КонецЕсли;	
	//Нечаева --
	
	Если НЕ (ВидДокумента="КонтрактСПроизводителем" или  ВидДокумента="ЗаказПоставщику") тогда
		Если Документ[ИмяРеквизитаСостояние]<>Перечисления.СостоянияНакладной.Сканирование Тогда
			Предупреждение("Не допустимое состояние накладной ! 
			|Заполняются только документы в состоянии ""Сканирование""
			|Текущее состояние: """+Документ[ИмяРеквизитаСостояние]+""" !");
			Возврат;
		КонецЕсли;	
	Конецесли;

	ДокОбъект=Документ.ПолучитьОбъект();
	
	//Мессерле

	
	Запрос=Новый Запрос;
	
	 запрос2=новый запрос;
					 запрос2.Текст="ВЫБРАТЬ
					               |	ЗаказПоставщику.Ссылка
					               |ИЗ
					               |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
					               |ГДЕ
					               |	ЗаказПоставщику.ДокОснование = &ДокОснование
					               |	И (НЕ ЗаказПоставщику.ПометкаУдаления)";
								   
								   Запрос2.УстановитьПараметр("ДокОснование",Документ.Ссылка);
								   
								   Выб=Запрос2.Выполнить().Выбрать();
								   Если выб.Следующий() тогда
									   ДокОсн=выб.ссылка;
								   иначе
									   докосн=НЕОПРЕДЕЛЕНО;
								   Конецесли;	   

								   
	Минусуем=Ложь;
	Если ДокОсн<>НЕОПРЕДЕЛЕНО тогда //Ищем документ с остатком в зоне сборки
			Минусуем=ИСТИНА;
	Конецесли;	
	
	
	//Мессерле
	
	//10.01.12
	
	 Если  ВидДокумента="ЗаказПоставщику" и документ.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад тогда    
		  //Не с чем сравнивать! Это отгрузка
		  докобъект.Товары.Очистить();
		  докобъект.ТоварыПартии.Очистить();
	 конецесли;
	 
	Если НЕ (ВидДокумента="ЗаказПоставщику" и Минусуем)  тогда
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ЛистНабораТовары.Номенклатура,
	|	ЛистНабораТовары.ШтВКоробе как ШтукВКоробе, выбор когда ЛистНабораТовары.ШтВКоробе=0 тогда СУММА(ЛистНабораТовары.Количество) иначе СУММА(ЛистНабораТовары.Количество)/ЛистНабораТовары.ШтВКоробе конец  как КоличествоКоробов,ЛистНаборатовары.ссылка.Им7,
	|	СУММА(ЛистНабораТовары.Количество) КАК "+ИмяРеквизитаКоличество+"
	|ИЗ
	|	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	|ГДЕ
	|	ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснование
	|	И  ЛистНабораТовары.Ссылка.Проведен
	|СГРУППИРОВАТЬ ПО
	|	ЛистНабораТовары.Номенклатура,ЛистНабораТовары.ШтВКоробе,ЛистНаборатовары.ссылка.Им7 упорядочить по ЛистНабораТовары.Номенклатура";
	
	//Кухарь начало 21.09.12 пересчёт Кол-ва коробов из ЛН
	коробки = новый Запрос;
	Коробки.Текст="ВЫБРАТЬ
	              |	СУММА(ЛистНабора.КоличествоКоробок) КАК КоличествоКоробок
	              |ИЗ
	              |	Документ.ЛистНабора КАК ЛистНабора
	              |ГДЕ
	              |	ЛистНабора.Проведен
				  |	И ЛистНабора.ДокОснование = &ДокОснование";
	Коробки.УстановитьПараметр("ДокОснование",Документ.Ссылка);
	КолКор=Коробки.Выполнить().Выгрузить().Получить(0).КоличествоКоробок;
	//Кухарь конец 21.09.12
	
	иначе
		Запрос.Текст="ВЫБРАТЬ
					 |	аа.Номенклатура,
					 |	аа.ШтукВКоробе,
					 |	СУММА(аа.КоличествоКоробов) КАК КоличествоКоробов,
					 |	аа.ИМ7,
					 |	СУММА(аа.Количество) КАК Количество
					 |ИЗ
					 |	(ВЫБРАТЬ
					 |		ЛистНабораТовары.Номенклатура КАК Номенклатура,
					 |		ЛистНабораТовары.ШтВКоробе КАК ШтукВКоробе,
					 |		ВЫБОР
					 |			КОГДА ЛистНабораТовары.ШтВКоробе = 0
					 |				ТОГДА ЛистНабораТовары.Количество
					 |			ИНАЧЕ ЛистНабораТовары.Количество / ЛистНабораТовары.ШтВКоробе
					 |		КОНЕЦ КАК КоличествоКоробов,
					 |		ЛистНабораТовары.Ссылка.ИМ7 КАК ИМ7,
					 |		ЛистНабораТовары.Количество КАК Количество
					 |	ИЗ
					 |		Документ.ЛистНабора.Товары КАК ЛистНабораТовары
					 |	ГДЕ
					 |		ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснование
					 |		И ЛистНабораТовары.Ссылка.Проведен
					 |	
					 |	ОБЪЕДИНИТЬ ВСЕ
					 |	
					 |	ВЫБРАТЬ
					 |		ЛистНабораТовары.Номенклатура,
					 |		ЛистНабораТовары.ШтВКоробе,
					 |		-ВЫБОР
					 |			КОГДА ЛистНабораТовары.ШтВКоробе = 0
					 |				ТОГДА ЛистНабораТовары.Количество
					 |			ИНАЧЕ ЛистНабораТовары.Количество / ЛистНабораТовары.ШтВКоробе
					 |		КОНЕЦ,
					 |		ЛистНабораТовары.Ссылка.ИМ7,
					 |		-ЛистНабораТовары.Количество
					 |	ИЗ
					 |		Документ.ЛистНабора.Товары КАК ЛистНабораТовары
					 |	ГДЕ
					 |		ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснованиеЗПС
					 |		И ЛистНабораТовары.Ссылка.Проведен
					 |) КАК аа
					 |
					 |СГРУППИРОВАТЬ ПО
					 |	аа.Номенклатура,
					 |	аа.ИМ7,
					 |	аа.ШтукВКоробе";
		
					//Запрос.Текст="ВЫБРАТЬ
					//			 |	ЛистНабораТовары.Номенклатура КАК Номенклатура,
					//			 |	ЛистНабораТовары.ШтВКоробе КАК ШтукВКоробе,
					//			 |	СУММА(ВЫБОР
					//			 |			КОГДА ЛистНабораТовары.ШтВКоробе = 0
					//			 |				ТОГДА ЛистНабораТовары.Количество
					//			 |			ИНАЧЕ ЛистНабораТовары.Количество / ЛистНабораТовары.ШтВКоробе
					//			 |		КОНЕЦ - ЕСТЬNULL(ВЫБОР
					//			 |				КОГДА ЛистНабораТовары1.ШтВКоробе = 0
					//			 |					ТОГДА ЛистНабораТовары1.Количество
					//			 |				ИНАЧЕ ЛистНабораТовары1.Количество / ЛистНабораТовары1.ШтВКоробе
					//			 |			КОНЕЦ, 0)) КАК КоличествоКоробов,
					//			 |	ЛистНабораТовары.Ссылка.ИМ7 КАК ИМ7,
					//			 |	СУММА(ЛистНабораТовары.Количество - ЕСТЬNULL(ЛистНабораТовары1.Количество, 0)) КАК Количество
					//			 |ИЗ
					//			 |	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
					//			 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.Товары КАК ЛистНабораТовары1
					//			 |		ПО ЛистНабораТовары.Номенклатура = ЛистНабораТовары1.Номенклатура
					//			 |			И ЛистНабораТовары.Ссылка.ИМ7 = ЛистНабораТовары1.Ссылка.ИМ7
					//			 |			И ЛистНабораТовары.ШтВКоробе = ЛистНабораТовары1.ШтВКоробе
					//			 |			И (ЛистНабораТовары1.Ссылка.ДокОснование = &ДокОснованиеЗПС)
					//			 |			И (ЛистНабораТовары1.Ссылка.Проведен)
					//			 |ГДЕ
					//			 |	ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснование
					//			 |	И ЛистНабораТовары.Ссылка.Проведен
					//			 |
					//			 |СГРУППИРОВАТЬ ПО
					//			 |	ЛистНабораТовары.Номенклатура,
					//			 |	ЛистНабораТовары.ШтВКоробе,
					//			 |	ЛистНабораТовары.Ссылка.ИМ7";

                  						   
					 Запрос.УстановитьПараметр("ДокОснованиеЗПС",ДокОсн);
 
	Конецесли;
	Запрос.УстановитьПараметр("ДокОснование",Документ.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	
	ВидОснования=Документ.Метаданные().Имя;
	
	ЕстьКорректировки=Ложь;
	
	ОбработанныеСтроки=Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл	
		
		если ВидОснования="ПриходнаяНакладная" и докобъект.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад тогда
			отбор=новый структура;
			отбор.Вставить("Номенклатура",Выборка.Номенклатура);
			отбор.Вставить("ШтВКоробе",Выборка.ШтукВКоробе);
			Масс=ДокОбъект.Товары.НайтиСтроки(Отбор);
			Если Масс.количество()=0 тогда
				отбор=новый структура;
				отбор.Вставить("Номенклатура",Выборка.Номенклатура);
				отбор.Вставить("ШтВКоробе",0);
				Масс=ДокОбъект.Товары.НайтиСтроки(Отбор);
			Конецесли;
			Если масс.количество()>1 тогда
				Предупреждение(""+ДокОбъект+" "+Выборка.Номенклатура+" Внутренняя ошибка.Обратитесь в ИТ-отдел");Возврат;
			Конецесли;	
			Если масс.количество()=0 тогда
				СтрокаТч=НЕОПРЕДЕЛЕНО;
			иначе
				СтрокаТч=Масс[0];
			Конецесли;
			
		иначе	
			СтрокаТЧ=ДокОбъект.Товары.Найти(Выборка.Номенклатура);
			//крохин начало 15.11.2011
			//для РНК с комплектацией сравниваем ТЧ "комплектующие"
			Если ДокОбъект.Метаданные().Имя = "РасходнаяНакладная" И ДокОбъект.ОтгрузкаКомплектов Тогда
			СтрокаТЧ=ДокОбъект.Комплектующие.Найти(Выборка.Номенклатура,"Номенклатура");
			КонецЕсли;
			//крохин конец 15.11.2011
		Конецесли;
	
	
		Если СтрокаТЧ=Неопределено Тогда
			Если ВидОснования="РасходнаяНакладная" Тогда
				Если Выборка.Количество<>0 Тогда
					Сообщить("Позиция: """+Выборка.Номенклатура+""" отсутствует в накладной !!! Данная позиция не добавлена в накладную !!!",СтатусСообщения.ОченьВажное);				
				КонецЕсли;				
				Продолжить;
			КонецЕсли; 			
			СтрокаТЧ=ДокОбъект.Товары.Добавить();		
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
			ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ,ДокОбъект);			
		Иначе
			//крохин начало 15.11.2011
			//для РНК с комплектацией сравниваем ТЧ "комплектующие"
			//СтрокаТЧ[ИмяРеквизитаКоличество]=Выборка[ИмяРеквизитаКоличество];
			Если ДокОбъект.Метаданные().Имя = "РасходнаяНакладная" И ДокОбъект.ОтгрузкаКомплектов Тогда
				Отбор=новый Структура;
				Отбор.Вставить("Номенклатура",Выборка.Номенклатура);
				МассивСтрок=ДокОбъект.Комплектующие.НайтиСтроки(Отбор);
				Остаток=Выборка[ИмяРеквизитаКоличество];
				Для каждого СтрокаКомлектующих из МассивСтрок цикл
					Если Остаток >= СтрокаКомлектующих.Количество Тогда
						Остаток=Остаток - СтрокаКомлектующих.Количество;
					Иначе
						СтрокаКомлектующих.Количество = Остаток;
						Остаток=0; 
					КонецЕсли;
					ОбработанныеСтроки.Вставить(СтрокаТЧ,Истина);
				Конеццикла;
				
			Иначе
				СтрокаТЧ[ИмяРеквизитаКоличество]=Выборка[ИмяРеквизитаКоличество];
			КонецЕсли;
			
			//крохин конец 15.11.2011
			
			
		КонецЕсли;
		
		Если ВидОснования="ПриходнаяНакладная" тогда
			СтрокаТЧ.ШтВКоробе=выборка.штуквкоробе;
			СтрокаТЧ.КоличествоКоробов=выборка.КоличествоКоробов;
		Конецесли;
 		
			
		Если ВидДокумента="Перемещение" И ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка" 
			И ДокОбъект.СостояниеНакладнойУПолучателя<>Перечисления.СостоянияНакладной.Принята Тогда
			СтрокаТЧ.Количество=СтрокаТЧ.ПодтвержденнаяЗаявка;
		КонецЕсли; 
		
		//Нечаева-+++
		Если ВидДокумента="ПродажаИМ" И ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка" Тогда			
			СтрокаТЧ.Количество=СтрокаТЧ.ПодтвержденнаяЗаявка-СтрокаТЧ.Возврат;
		КонецЕсли; 
		//Нечаева ---
		//крохин начало 15.11.2011
			//для РНК с комплектацией сравниваем ТЧ "комплектующие", отработанные строки вставлены ранее
			
		//ОбработанныеСтроки.Вставить(СтрокаТЧ,Истина);	
		Если ДокОбъект.Метаданные().Имя = "РасходнаяНакладная" И ДокОбъект.ОтгрузкаКомплектов Тогда
		Иначе
			ОбработанныеСтроки.Вставить(СтрокаТЧ,Истина);
		КонецЕсли;
		//крохин конец 15.11.2011
		 
		 
		РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокОбъект);
		
		ЕстьКорректировки=Истина;
		
		//Партии
		Если  (ВидДокумента="КонтрактСПроизводителем" или  ВидДокумента="ЗаказПоставщику" или (ВидДокумента="Инвентаризация" и документ.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад)) тогда    
			
			Отбор=новый структура;
			отбор.Вставить("Номенклатура",Выборка.Номенклатура);
			отбор.Вставить("Им7",Выборка.Им7);
			
			если выборка.штуквкоробе<>0 тогда
				отбор.Вставить("ШтукВКоробе",Выборка.ШтукВКоробе);
			Конецесли;
			
			Масс=ДокОбъект.ТоварыПартии.НайтиСтроки(отбор);
			
			Если Масс.Количество()>1 тогда
				сообщить("Для "+Выборка.Номенклатура+" по "+Выборка.Им7+" и шт. в кор.="+Выборка.ШтукВКоробе+" есть дублирующиеся строки!");Возврат;
			Конецесли;
			
			Если Масс.Количество()=1 тогда
				СтрокаТЧ1=масс[0];
			иначе
				СтрокаТЧ1=ДокОбъект.Товарыпартии.Добавить();		
				ЗаполнитьЗначенияСвойств(СтрокаТЧ1,Выборка);
			Конецесли;
			
			
			Если  (ВидДокумента="Инвентаризация" и документ.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад) тогда    
				
				СтрокаТЧ1.КоличествоФакт=Выборка.Количество;
				
				//Вот здесь геморой, т.к. по партиям может быть много строк, а по товарам только одна
				СтрокаТЧ1.ШтукВКоробе=выборка.штуквкоробе;
                		
				Отбор=новый структура;
				отбор.Вставить("Номенклатура",Выборка.Номенклатура);
				Масс=ДокОбъект.ТоварыПартии.НайтиСтроки(отбор);
				
				фактОст=0;
				Для каждого стр из масс цикл
					ФактОст=ФактОст+стр.КоличествоФакт;
				Конеццикла;	
				
				СтрокаТЧ.КоличествоФакт=ФактОст;
				СтрокаТЧ.Количество=СтрокаТЧ.КоличествоФакт-СтрокаТЧ.КоличествоРасч;
				
			иначе
				СтрокаТЧ1.Количество=Выборка.Количество;
			Конецесли;
			
		КонецЕсли;	
		
	Конеццикла;
	
	 //Мессерле
	 Если  ВидДокумента="ЗаказПоставщику" и документ.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад тогда    
	 //Загрузим товары из партий
	 тз2=новый ТаблицаЗначений;
	 тз2=ДокОбъект.ТоварыПартии.выгрузить();
	 Тз2.колонки.добавить("Заявка");
	 Тз2.колонки.добавить("СтавкаНДС"); 
	 Тз2.колонки.добавить("ПодтвержденнаяЗаявка");
	 
	 для каждого стр2 из тз2 цикл
		 стр2.заявка=стр2.количество;
		 стр2.ставкандс=ПолучитьРеквизитРодителя(стр2.номенклатура,"СтавкаНДС");
		 стр2.ПодтвержденнаяЗаявка =стр2.количество;
	 Конеццикла;		 
	 Тз2.свернуть("Номенклатура,СтавкаНДС","количество,Заявка,ПодтвержденнаяЗаявка");
	 докобъект.товары.загрузить(Тз2);
	 Для каждого стр2 из докобъект.товары цикл
		РассчитатьСуммуТабЧасти(Стр2,ДокОбъект);
	 Конеццикла;	 
	 
	 иначе
	//крохин начало 15.11.2011
    //для РНК с комплектацией сравниваем ТЧ "комплектующие", и затем корректируем товары
	//	Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
	//	Если ОбработанныеСтроки[СтрокаТЧ]=Неопределено Тогда
	//		СтрокаТЧ[ИмяРеквизитаКоличество]=0;
	//		
	//		Если ВидДокумента="Перемещение" И ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка" 
	//		И (ДокОбъект.СостояниеНакладнойУПолучателя.Пустая()
	//			ИЛИ ДокОбъект.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.ВРаботе) Тогда			
	//			
	//			СтрокаТЧ.Количество=СтрокаТЧ.ПодтвержденнаяЗаявка;
	//		КонецЕсли; 
	//		
	//		//Нечаева-+++
	//		Если ВидДокумента="ПродажаИМ" И ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка" Тогда			
	//			СтрокаТЧ.Количество=СтрокаТЧ.ПодтвержденнаяЗаявка-СтрокаТЧ.Возврат;
	//		КонецЕсли; 
	//		//Нечаева ---
	//   		
	//		РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокОбъект);
	//		ЕстьКорректировки=Истина;
	//	КонецЕсли;
	//КонецЦикла; 	

	Если ДокОбъект.Метаданные().Имя = "РасходнаяНакладная" И ДокОбъект.ОтгрузкаКомплектов Тогда
		//обработка комплектующих
		
  Для Каждого СтрокаТЧ Из ДокОбъект.Комплектующие Цикл
	 Если ОбработанныеСтроки[СтрокаТЧ]=Неопределено Тогда
			СтрокаТЧ[ИмяРеквизитаКоличество]=0;
       		РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокОбъект);
			ЕстьКорректировки=Истина;
      КонецЕсли;
  КонецЦикла;
      //обработка товаров
	  ТаблицаТоваров = ДокОбъект.Комплектующие.Выгрузить();
  ТаблицаТоваров.Свернуть("Продукция","Количество");
  Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
	  СтрокаТаблицы = ТаблицаТоваров.Найти(СтрокаТЧ.Номенклатура,"Продукция");
	  Если СтрокаТаблицы = Неопределено Тогда
		  СтрокаТч.Количество = 0;
		  РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокОбъект);
			ЕстьКорректировки=Истина;
	  ИначеЕсли  СтрокаТч.Количество <> СтрокаТаблицы.Количество Тогда
		  СтрокаТч.Количество = СтрокаТаблицы.Количество;
		  РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокОбъект);
			ЕстьКорректировки=Истина;
	  КонецЕсли;
  КонецЦикла;  
	Иначе
	Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
		Если ОбработанныеСтроки[СтрокаТЧ]=Неопределено Тогда
			СтрокаТЧ[ИмяРеквизитаКоличество]=0;
			
			Если ВидДокумента="Перемещение" И ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка" 
			И (ДокОбъект.СостояниеНакладнойУПолучателя.Пустая()
				ИЛИ ДокОбъект.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.ВРаботе) Тогда			
				
				СтрокаТЧ.Количество=СтрокаТЧ.ПодтвержденнаяЗаявка;
			КонецЕсли; 
			
			//Нечаева-+++
			Если ВидДокумента="ПродажаИМ" И ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка" Тогда			
				СтрокаТЧ.Количество=СтрокаТЧ.ПодтвержденнаяЗаявка-СтрокаТЧ.Возврат;
			КонецЕсли; 
			//Нечаева ---
   			
			РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокОбъект);
			ЕстьКорректировки=Истина;
		КонецЕсли;
	КонецЦикла; 	
	 КонецЕсли;
	
    //крохин конец 15.11.2011
		Если НЕ ЕстьКорректировки Тогда
		Предупреждение("Накладная не откорректирована !",3);
		Возврат		
	КонецЕсли;

	Конецесли; //Мессерле- заполнение ЗПС в РИге
	
	ВидДокумента			=ДокОбъект.Метаданные().Имя;
	
	//Мессерле
	Если  ВидДокумента="Инвентаризация" тогда
		для каждого стр5 из ДокОбъект.товары цикл
			стр5.количество=стр5.количествофакт-стр5.количестворасч;
		Конеццикла;
	Конецесли;
    //Мессерле

	РежимЗаписи=?(ДокОбъект.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись);
	ДокОбъект.Товары.Сортировать("Номенклатура");
	Если (ВидДокумента="КонтрактСПроизводителем" или  ВидДокумента="ЗаказПоставщику" или (ВидДокумента="Инвентаризация" и документ.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад)) тогда
	ДокОбъект.ТоварыПартии.Сортировать("Номенклатура");
	Конецесли;
	Попытка	
		ДокОбъект.Записать(РежимЗаписи);	
	Исключение
		Предупреждение("Ошибка записи документа !");
		Возврат;
	КонецПопытки;
	
	ПолучитьРезультатСравнения();
	Ошибки		=ПолучитьОшибкиНабора();	
	ЕстьОшибки	=Ошибки.Ошибки;
	
	ИмяРеквизитаСостояние	="СостояниеНакладной";	
	СостояниеГотовности=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
	
	Если ВидДокумента="Перемещение" Тогда		
		Если Документ.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
		ИначеЕсли Документ.СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
			ИмяРеквизитаСостояние	="СостояниеНакладнойУПолучателя";			
			СостояниеГотовности		=Перечисления.СостоянияНакладной.ГотоваКПриемке;
		КонецЕсли;		
	КонецЕсли;
	
		
	//Мессерле
	Если  ВидДокумента="Инвентаризация" тогда
		для каждого стр5 из ДокОбъект.товары цикл
			стр5.количество=стр5.количествофакт-стр5.количестворасч;
		Конеццикла;
	Конецесли;
    //Мессерле

	Если НЕ ЕстьОшибки Тогда
		Если НЕ (ВидДокумента="КонтрактСПроизводителем" или  ВидДокумента="ЗаказПоставщику" или (ВидДокумента="Инвентаризация" и документ.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад)) тогда
			
			Если ДокОбъект[ИмяРеквизитаСостояние]=Перечисления.СостоянияНакладной.Сканирование Тогда
				ВидДокумента			=ДокОбъект.Метаданные().Имя;
				ДокОбъект.ОбъемКоробов	=Ошибки.ОбъемКоробов;
				Если ВидДокумента="ПриходнаяНакладная" Тогда		
					ДокОбъект.СостояниеНакладной	=Перечисления.СостоянияНакладной.ГотоваКПриемке;
				ИначеЕсли ВидДокумента="РасходнаяНакладная" Тогда				
					ДокОбъект.СостояниеНакладной	=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
					//крохин начало 16.02.2012
					//если требуется доп.обработка, ставим такое состояние					
						Для Каждого СтрокаДопОбработки Из ДокОбъект.ДопОбработки Цикл
							Если СтрокаДопОбработки.ВидДопОбработки <> Справочники.ВидыДопОбработки.БезОбработки Тогда
							ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ДопОбработка;	
							Прервать;	
							КонецЕсли;
						КонецЦикла;
					//крохин конец 16.02.2012
				ИначеЕсли ВидДокумента="Перемещение" Тогда				
					ДокОбъект[ИмяРеквизитаСостояние]=СостояниеГотовности;
				КонецЕсли;	
			Конецесли;
			
			//Кухарь начало 21.09.12 пересчёт Кол-ва коробов из ЛН
			если ВидДокумента="Перемещение" или ВидДокумента="ПриходнаяНакладная" или ВидДокумента="РасходнаяНакладная" тогда
				ДокОбъект.количествокоробок=КолКор;
			КонецЕсли;
			//Кухарь конец 21.09.12

			
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПолучитьРезультатСравнения(СУчетомНедостач=Ложь) Экспорт
	Если Документ=Неопределено Тогда Возврат КонецЕсли;
	
	//крохин начало 17.10.2013
	//отличие от полного сравнения - не вся номенклатура и не все ЛН
	СписокНоменклатуры = Новый СписокЗначений;
	СписокЛистовНабора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистНабора.Ссылка
	               |ИЗ
	               |	Документ.ЛистНабора КАК ЛистНабора
	               |ГДЕ
	               |	ЛистНабора.ДокОснование = &ДокОснование";
				   Запрос.УстановитьПараметр("ДокОснование",Документ);
				   Выборка = запрос.Выполнить().Выбрать();
				   Пока Выборка.Следующий() Цикл
					   Для Сч = 0 По СписокСтрок.Количество()-1 Цикл
						   //Если Найти(Выборка.Ссылка.комментарий,"!"+СписокСтрок.Получить(Сч)) Тогда
						   //СписокЛистовНабора.Добавить(Выборка.Ссылка); 
						   // Прервать;
						   //КонецЕсли;
						   //из ТЧ
						   НайденнаяСтрока = выборка.ссылка.СтрокиПлановНабора.Найти(СписокСтрок.Получить(Сч).Значение,"НомерСтрокиПланаНабора");
						   Если НайденнаяСтрока <> Неопределено Тогда
							СписокЛистовНабора.Добавить(Выборка.Ссылка);  
						   КонецЕсли;
					   КонецЦикла; 
					   КонецЦикла; 

    Для Сч = 0 По СписокСтрок.Количество()-1 Цикл			   
	СтрокаДокумента = ПланНабора.тБрэндов.Получить(СписокСтрок.Получить(Сч).Значение-1);	
	СписокНоменклатуры.Добавить(СтрокаДокумента.Коллекция);
	КонецЦикла;
			   
	//крохин конец 17.10.2013
	
	ВидДокумента=Документ.Метаданные().Имя;
	
	ИмяРеквизитаКоличество	="Количество";
	ИмяТЧ					="Товары";
	
	Если ВидДокумента="Перемещение" Тогда
		Если Документ.СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда			
		ИначеЕсли Документ.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда			
			ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка"; //Отгружено
		КонецЕсли;		
	ИначеЕсли ВидДокумента="Инвентаризация" Тогда
		ИмяРеквизитаКоличество="КоличествоФакт";		
	ИначеЕсли ВидДокумента="Комплектация" Тогда
		ИмяТЧ="Комплектующие";
	// +++ Родионов, 2011-11-02, Если РНК содержит КМП тогда сравнение с ЛН должно проходить по колонке "Номенклатура" закладки "Комплектующие"
	ИначеЕсли ВидДокумента = "РасходнаяНакладная" Тогда
		Если  Документ.ОтгрузкаКомплектов Тогда
			// это РНК+КМПЛ
			ИмяТЧ = "Комплектующие";
		КонецЕсли;
	// 2011-11-02, Если РНК содержит КМП тогда сравнение с ЛН должно проходить по колонке "Номенклатура" закладки "Комплектующие", Родионов +++	
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	ПРЕДСТАВЛЕНИЕ(Номенклатура) КАК НоменклатураПредставление,
	|	Номенклатура,
	|	Номенклатура.Код77 КАК Код77,
	|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	НомерЛН,
	|	СУММА(КолВНакл) КАК КолВНакл,	
	|	СУММА(КолВЛН) КАК КолВЛН,
	|	СУММА(КолВНакл)-СУММА(КолВЛН) КАК Разница,	
	|	ВЫБОР 
	|		КОГДА СУММА(КолВНакл)>СУММА(КолВЛН) ТОГДА СУММА(КолВНакл)-СУММА(КолВЛН)
	|		ИНАЧЕ СУММА(КолВЛН)-СУММА(КолВНакл)
	|	КОНЕЦ
	|	КАК МодульРазницы
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	Номенклатура,
	|	""НАКЛ"" КАК НомерЛН,
	|	"+ИмяРеквизитаКоличество+" КАК КолВНакл,
	|	0 КАК КолВЛН
	|ИЗ
	|	Документ."+ВидДокумента+"."+ИмяТЧ+" КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка	
	|	И "+ИмяРеквизитаКоличество+" <> 0
	//крохин начало 17.10.2013
	|	И Номенклатура В ИЕРАРХИИ (&СписокНоменклатуры)
	//крохин конец 17.10.2013
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Ссылка.Номер КАК НомерЛН,
	|	0 КАК КолВНакл,
	|	Количество КАК КолВЛН
	|ИЗ
	|	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	|ГДЕ
	|	Ссылка.ДокОснование= &Ссылка
	|	И Ссылка.Проведен
	|	И Ссылка<>&ИсключаемыйЛН
	//крохин начало 17.10.2013
	|	И Ссылка В  (&СписокЛистовНабора)
	|	И Номенклатура В ИЕРАРХИИ (&СписокНоменклатуры)
	//крохин конец 17.10.2013
	//крохн начало 31.10.2013
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Ссылка.Номер КАК НомерЛН,
	|	0 КАК КолВНакл,
	|	Количество КАК КолВЛН
	|ИЗ
	|	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	|ГДЕ
	|	Ссылка.ДокОснование= &Ссылка
	|	И Ссылка.Проведен
	|	И Ссылка=&ИсключаемыйЛН
	//крохин начало 17.10.2013
//	|	И Ссылка В  (&СписокЛистовНабора)
//	|	И Номенклатура В ИЕРАРХИИ (&СписокНоменклатуры)
	//крохин конец 17.10.2013
    //крохн конец 17.10.2013
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО Номенклатура,НомерЛН	
	|ИТОГИ 
	|	СУММА(КолВНакл),СУММА(КолВЛН),СУММА(Разница),СУММА(МодульРазницы) 
	|ПО ОБЩИЕ,Номенклатура ИЕРАРХИЯ,НомерЛН"; 
	// Кухарь А.Ю.  23.10.2025 начало   
	//Help-7574	
	//|АВТОУПОРЯДОЧИВАНИЕ";
	// Кухарь А.Ю.  23.10.2025 конец

	Запрос.УстановитьПараметр("ИсключаемыйЛН",ИсключаемыйЛН);
    Запрос.УстановитьПараметр("Ссылка",Документ);
	//крохин начало 17.10.2013
	 Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
Запрос.УстановитьПараметр("СписокЛистовНабора",СписокЛистовНабора);
	//крохин конец 17.10.2013
	Результат=Запрос.Выполнить();

	РезультатСравнения=Результат;
КонецПроцедуры

Функция ВывестиРезультатСравнения() Экспорт
    ТД=Новый ТабличныйДокумент;
	
	Макет=ПолучитьМакет("СравнениеЛН");
	
	ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок|Начало");
	
	ОблЗаголовок.Параметры.Док=Документ;
	ОблЗаголовок.Параметры.Заполнить(Документ);
	
	ТД.Вывести(ОблЗаголовок);
	ТД.Вывести(Макет.ПолучитьОбласть("Шапка|Начало"));
	
	ТД.НачатьАвтогруппировкуКолонок();
			
	ВыборкаПоЛН=РезультатСравнения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НомерЛН");
	Пока ВыборкаПоЛН.Следующий() Цикл
		Если ВыборкаПоЛН.НомерЛН="НАКЛ" Тогда Продолжить КонецЕсли;
		
		ОблЛН=Макет.ПолучитьОбласть("Шапка|НомерЛН");
		ОблЛН.Параметры.НомерЛН=СтрЗаменить(ВыборкаПоЛН.НомерЛН,СокрЛП(Документ.Номер)+"/","");
		ТД.Присоединить(ОблЛН,1);	
	КонецЦикла; 
	
	ТД.Присоединить(Макет.ПолучитьОбласть("Шапка|Разница"));	
	
	ТД.ФиксацияСверху=ТД.ВысотаТаблицы;
		
	ТД.НачатьАвтогруппировкуСтрок();	
	
	ЕстьОшибки=Ложь;
		
	ВыборкаПоНоменклатуре=РезультатСравнения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");
	Всего=ВыборкаПоНоменклатуре.Количество();
	
	Пока ВыборкаПоНоменклатуре.Следующий() Цикл
		ОбработкаПрерыванияПользователя();
		
		Состояние(Всего);
		Всего=Всего-1;
		
		ОблСтрока=Макет.ПолучитьОбласть("Строка|Начало");
		
		ОблСтрока.Параметры.Заполнить(ВыборкаПоНоменклатуре);
		Если НЕ ВыборкаПоНоменклатуре.ЭтоГруппа Тогда		
			ОблСтрока.Параметры.Код77=ВыборкаПоНоменклатуре.Код77;
		ИначеЕсли фТолькоОшибки Тогда
			Продолжить;			
		КонецЕсли; 
		Если ВыборкаПоНоменклатуре.Разница=0 И фТолькоОшибки Тогда Продолжить КонецЕсли; 
		
		
		ТД.Вывести(ОблСтрока,ВыборкаПоНоменклатуре.Уровень(),,Ложь);
		
		Если фВыводитьЛН Тогда
			ВыборкаПоЛН=ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НомерЛН","Все");
			Пока ВыборкаПоЛН.Следующий() Цикл
				Если ВыборкаПоЛН.НомерЛН="НАКЛ" Тогда Продолжить КонецЕсли;
				
				ОблЛН=Макет.ПолучитьОбласть("Строка|НомерЛН");
				ОблЛН.Параметры.Заполнить(ВыборкаПоЛН);
				
				ТД.Присоединить(ОблЛН);		
			КонецЦикла;			
		КонецЕсли;		
		
		ОблКонец=Макет.ПолучитьОбласть("Строка|Разница");
		ОблКонец.Параметры.Заполнить(ВыборкаПоНоменклатуре);
		
		ТД.Присоединить(ОблКонец,0);
		
		ТекОбласть=ТД.Область(ТД.ВысотаТаблицы,2,ТД.ВысотаТаблицы,ТД.ШиринаТаблицы);
		
		Если ВыборкаПоНоменклатуре.ЭтоГруппа Тогда
			ТекОбласть.Шрифт=Новый Шрифт(,,Истина);	
		КонецЕсли; 
				
		Если ВыборкаПоНоменклатуре.Разница>0 Тогда
			ЕстьОшибки=Истина;
			ТекОбласть.ЦветФона=Новый Цвет(255,255,0);		
		ИначеЕсли ВыборкаПоНоменклатуре.Разница<0 Тогда
			ЕстьОшибки=Истина;
			ТекОбласть.ЦветФона=Новый Цвет(255,150,150);
		КонецЕсли;		
	КонецЦикла; 
	
	ТД.ЗакончитьАвтогруппировкуСтрок();
	
	ТД.ЗакончитьАвтогруппировкуКолонок();
	
	
	ОблИтогоНачало	=Макет.ПолучитьОбласть("Итого|Начало");
	ОблИтогоРазница	=Макет.ПолучитьОбласть("Итого|Разница");
	
	Выборка=РезультатСравнения.Выбрать();
	Если Выборка.Следующий() Тогда
		ОблИтогоНачало.Параметры.Заполнить(Выборка);
		ОблИтогоРазница.Параметры.Заполнить(Выборка);		
	КонецЕсли; 
	ТД.Вывести(ОблИтогоНачало);
	
	ВыборкаПоЛН=РезультатСравнения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НомерЛН");
	Пока ВыборкаПоЛН.Следующий() Цикл
		Если ВыборкаПоЛН.НомерЛН="НАКЛ" Тогда Продолжить КонецЕсли;
		
		ОблЛН=Макет.ПолучитьОбласть("Итого|НомерЛН");
		ОблЛН.Параметры.Заполнить(ВыборкаПоЛН);
		ТД.Присоединить(ОблЛН);	
	КонецЦикла;
	ТД.Присоединить(ОблИтогоРазница);
	
	ТД.ОтображатьЗаголовки	=Ложь;
	ТД.ОтображатьСетку		=Ложь;
	
	ТД.ИмяПараметровПечати			="ОпцииПечати_СравнениеЛистовНабора";
	ТД.ИмяСохраненияПоложенияОкна   ="РазмерОкна_СравнениеЛистовНабора";
	
	Обл=ТД.Область(6,2,6,2);
	Если ЕстьОшибки Тогда
		Обл.Текст="ЕСТЬ ОШИБКИ НАБОРА";	
		Обл.ЦветТекста=Новый Цвет(255,0,0);		
	Иначе
		Обл.Текст="НЕТ ОШИБОК";			
	КонецЕсли; 
	
	#ЕСЛИ КЛИЕНТ ТОГДА 
	УстановитьКолонтитулы(ТД);	
	#КОНЕЦЕСЛИ
	
	//ТД.Показать("Сравнение набора: "+Документ);	
	Возврат ТД;	
КонецФункции

Функция ПолучитьОбъемКоробов()
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	СУММА(ОбъемКоробов) КАК ОбъемКоробов,	
	|	СУММА(КоличествоКоробок) КАК КоличествоКоробок
	|ИЗ
	|	Документ.ЛистНабора
	|ГДЕ
	|	ДокОснование= &Ссылка
	|	И Проведен";
		
	Запрос.УстановитьПараметр("Ссылка",Документ);	
		
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда		
		Результат=Новый Структура("ОбъемКоробов,КоличествоКоробок",Выборка.ОбъемКоробов,Выборка.КоличествоКоробок);
	Иначе
		Результат=Новый Структура("ОбъемКоробов,КоличествоКоробок",0,0);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьОбъемКоробов() 

Функция ПолучитьОшибкиНабора() Экспорт
	Ошибки=Ложь;
	
	ТП=Новый ТаблицаЗначений;
	ТП.Колонки.Добавить("Номенклатура");
	ТП.Колонки.Добавить("КолВНакл");
	ТП.Колонки.Добавить("КолВЛН");
	ТП.Колонки.Добавить("Разница");
	
	ТН=ТП.Скопировать();
	
	Если РезультатСравнения=Неопределено Тогда ПолучитьРезультатСравнения() КонецЕсли; 	
	Если РезультатСравнения=Неопределено Тогда Возврат Новый Структура("Ошибки,ТП,ТН",Истина,ТП,ТН) КонецЕсли; // видимо не указан докмент или какая ошибка		
	
	ВыборкаПоНоменклатуре=РезультатСравнения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");
	Пока ВыборкаПоНоменклатуре.Следующий() Цикл
		Если ВыборкаПоНоменклатуре.ТипЗаписи()=ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			Если ВыборкаПоНоменклатуре.Разница<0 Тогда //Перебор
				СтрокаТО=ТП.Добавить();
			ИначеЕсли ВыборкаПоНоменклатуре.Разница>0 Тогда //Недобор
				СтрокаТО=ТН.Добавить();
			Иначе //усе в порядке
				Продолжить;			
			КонецЕсли;		
			
			ЗаполнитьЗначенияСвойств(СтрокаТО,ВыборкаПоНоменклатуре);
			Ошибки=Истина;
		КонецЕсли;		
	КонецЦикла;
	
	ТП.Сортировать("Номенклатура");
	ТН.Сортировать("Номенклатура");
	
	ОбъемКоробов=ПолучитьОбъемКоробов();
	
	Возврат Новый Структура("Ошибки,ТП,ТН,ОбъемКоробов,КоличествоКоробок",Ошибки,ТП,ТН,ОбъемКоробов.ОбъемКоробов,ОбъемКоробов.КоличествоКоробок);
КонецФункции // ПолучитьОшибкиНабора()

Процедура ВывестиТаблицуОшибок(ТО,ВидТО) Экспорт
	ТД		=Новый ТабличныйДокумент;
	
	Макет	=ПолучитьМакет("ТаблицаОшибок");	
	
	ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок");
	ОблЗаголовок.Параметры.Документ	=Документ;
	ОблЗаголовок.Параметры.ВидТО	=ВидТО;
	
	ТД.Вывести(ОблЗаголовок);
	
	ОблШапка	=Макет.ПолучитьОбласть("Шапка");	
	ТД.Вывести(ОблШапка);
	
	Для Каждого СтрокаТО Из ТО Цикл
		ОблСтрока=Макет.ПолучитьОбласть("Строка");
		ОблСтрока.Параметры.Заполнить(СтрокаТО);	
		
		ТД.Вывести(ОблСтрока);
	КонецЦикла; 
	
	УстановитьКолонтитулы(ТД);	
	
	ТД.ИмяПараметровПечати			="ПараметрыПечати_ТаблицаОшибокНабора";
	ТД.ИмяСохраненияПоложенияОкна   ="ПоложениеОкна_ТаблицаОшибокНабора";
	ТД.ОтображатьСетку		=Ложь;
	ТД.ОтображатьЗаголовки	=Ложь;
	
	ТД.Показать("Перебор по накладной: "+Документ);
КонецПроцедуры
